<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 115.0.1901.188--><displayName/><description/><resources><stringTable><string id="WebView2LoaderOverrideSettings_group">Overschrijvingsinstellingen voor laadprogramma</string><string id="BrowserExecutableFolder">De locatie van de uitvoerbare map van de browser configureren</string><string id="BrowserExecutableFolder_Explain">Dit beleid configureert WebView2-toepassingen om de WebView2 Runtime in het opgegeven pad te gebruiken. De map moet de volgende bestanden bevatten: msedgewebview2.exe, msedge.dll, enzovoort.

Geef een waarde-naam en waarde-paar op om de waarde voor het mappad in te stellen. Stel de waardenaam in op de Gebruikersmodel-ID van de toepassen of de naam van het uitvoerbare bestand. U kunt het jokerteken '*' als waardenaam gebruiken voor alle toepassingen.

Voorbeeldwaarde:

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">De locatie van de uitvoerbare map van de browser configureren</string><string id="ReleaseChannelPreference">De voorkeur voor de zoekvolgorde van vrijgavekanalen instellen</string><string id="ReleaseChannelPreference_Explain">De standaard zoekvolgorde voor kanalen is WebView2 Runtime, Bèta, Dev en Canary.

Stel dit beleid in op 1 om de standaardzoekvolgorde om te keren.

Geef een waarde-naam en waarde-paar op om de waarde voor de voorkeur voor het releasekanaal in te stellen. Stel de waardenaam in op de Gebruikersmodel- ID of de naam van het uitvoerbare bestand. U kunt het jokerteken '*' als waardenaam gebruiken voor alle toepassingen.

Voorbeeldwaarde:

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">De voorkeur voor de zoekvolgorde van vrijgavekanalen instellen</string><string id="ExperimentationAndConfigurationServiceControl">Communicatie met de Experimenteer- en Configuratieservice beheren</string><string id="ExperimentationAndConfigurationServiceControl_Explain">De Experimenteer- en Configuratieservice wordt gebruikt om nettoladingen voor experimenten en configuratie te implementeren op de client.

Nettolading voor experimenten bestaat uit een lijst met functies in een vroege ontwikkelingsfase die Microsoft inschakelt voor testen en feedback.

Nettolading voor configuratie bestaat uit een lijst met aanbevolen instellingen die Microsoft wil implementeren om de gebruikerservaring te optimaliseren.

Nettolading voor configuratie kan ook een lijst bevatten met acties die voor bepaalde domeinen moeten worden uitgevoerd om compatibiliteitsredenen. De browser kan bijvoorbeeld de tekenreeks van de gebruikersagent op een website overschrijven als die website is beschadigd. Elk van deze acties is bedoeld als tijdelijke oplossing terwijl Microsoft probeert het probleem met de site-eigenaar op te lossen.

Als u dit beleid instelt op 'FullMode', wordt de volledige nettolading gedownload van de Experimenteer- en Configuratieservice. Dit omvat zowel de nettoladingen voor experimenten als configuratie.

Als u dit beleid instelt op 'ConfigurationsOnlyMode', wordt alleen de nettolading voor configuratie gedownload.

Als u dit beleid instelt op 'RestrictedMode', wordt de communicatie met de Experimenteer- en Configuratieservice volledig gestopt. Microsoft raadt deze instelling niet aan.

Als u dit beleid niet configureert op een beheerd apparaat, is het gedrag op bèta- en stabiele kanalen hetzelfde als bij 'ConfigurationsOnlyMode'. Op Canary- en Dev-kanalen is het gedrag hetzelfde als bij 'FullMode'.

Als u dit beleid niet configureert op een niet-beheerd apparaat, is het gedrag hetzelfde als bij 'FullMode'.

Toewijzing van beleidsopties:

* FullMode (2) = Configuraties en experimenten ophalen

* ConfigurationsOnlyMode (1) = Alleen configuraties ophalen

* RestrictedMode (0) = Communicatie met de Experimenteer- en Configuratieservice uitschakelen

Gebruik de voorgaande informatie bij het configureren van dit beleid.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Configuraties en experimenten ophalen</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Alleen configuraties ophalen</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Communicatie met de Experimenteer- en Configuratieservice uitschakelen</string><string id="SUPPORTED_WIN7_V97">Microsoft Edge versie 97, Windows 7 of hoger</string><string id="SUPPORTED_WIN7_V87">Microsoft Edge versie 87, Windows 7 of hoger</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - Standaardinstellingen (gebruikers kunnen deze overschrijven)</string></stringTable><presentationTable><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">De naam van de waarde instellen op de model-ID van de toepassingsgebruiker of de naam van het uitvoerbare bestand. U kunt het jokerteken '*' gebruiken als waardenaam om toe te passen op alle toepassingen.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">De naam van de waarde instellen op de model-ID van de toepassingsgebruiker of de naam van het uitvoerbare bestand. U kunt het jokerteken '*' gebruiken als waardenaam om toe te passen op alle toepassingen.</listBox></presentation><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Communicatie met de Experimenteer- en Configuratieservice beheren</dropdownList></presentation></presentationTable></resources></policyDefinitionResources>